tap "homebrew/bundle"
tap "homebrew/services"
tap "supabase/tap"
brew "astyle"
brew "openssl@3"
brew "bat"
brew "colima"
brew "docker"
brew "fd"
brew "fzf"
brew "gcc"
brew "gcc@13"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "nvm"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "stow"
brew "stripe-cli"
brew "temporal"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
cask "alfred"
cask "appcleaner"
cask "betterdisplay"
cask "bettermouse"
cask "bettertouchtool"
cask "bitwarden"
cask "brave-browser"
cask "chatgpt"
cask "cleanshot"
cask "coconutbattery"
cask "cursor"
cask "darktable"
cask "deluge"
cask "devutils"
cask "discord"
cask "downie"
cask "drawio"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "hiddenbar"
cask "iina"
cask "itsycal"
cask "keyboardcleantool"
cask "maccy"
cask "macs-fan-control"
cask "obsidian"
cask "permute"
cask "pop"
cask "postman"
cask "proxyman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "wezterm"
cask "whatsapp"
cask "zoom"
vscode "alefragnani.bookmarks"
vscode "chakrounanas.turbo-console-log"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "letrieu.expand-region"
vscode "murloccra4ler.leap"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "subframe7536.custom-ui-style"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
