tap "supabase/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk@21"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Display management tool
cask "betterdisplay"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Screen capturing tool
cask "cleanshot"
# Clean keyboard and trackpad
cask "cleanupbuddy"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Universal database tool and SQL client
cask "dbeaver-community"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
cask "font-jetbrains-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# Native desktop AI assistant from Google
cask "google-gemini"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Use your Sony camera as a high-quality webcam
cask "imaging-edge-webcam"
# Java IDE by JetBrains
cask "intellij-idea"
# Menu bar calendar
cask "itsycal"
# Free and Open Source Video Editor
cask "kdenlive"
# Clipboard manager
cask "maccy"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# Playstation 2 Emulator
cask "pcsx2"
# Converts and edits video, audio or image files
cask "permute"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
