tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "supabase/tap"
brew "openssl@3"
brew "bat"
brew "deno"
brew "fd"
brew "fzf"
brew "gcc"
brew "gcc@13"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "nvm"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "chatgpt"
cask "coconutbattery"
cask "deluge"
cask "discord"
cask "docker"
cask "drawio"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "keyboardcleantool"
cask "logi-options+"
cask "maccy"
cask "macs-fan-control"
cask "obs"
cask "obsidian"
cask "postman"
cask "proxyman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zoom"
vscode "denoland.vscode-deno"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.liveserver"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
