tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "anime-downloader"
brew "astyle"
brew "fzf"
brew "gcc"
brew "git"
brew "htop"
brew "imagemagick"
brew "python@3.10"
brew "jupyterlab"
brew "zlib"
brew "mysql", restart_service: true
brew "numpy"
brew "pyenv"
brew "tcl-tk"
brew "python-tk@3.10"
brew "ripgrep"
brew "rpcgen"
brew "s-search"
brew "smartmontools"
brew "speedtest-cli"
brew "tmux"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "android-studio"
cask "appcleaner"
cask "bitwarden"
cask "coconutbattery"
cask "deluge"
cask "discord"
cask "drawio"
cask "eclipse-java"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
cask "maccy"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "rectangle"
cask "skype"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
