tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "fzf"
brew "gcc"
brew "git"
brew "gnu-sed"
brew "htop"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "nvm"
brew "openssl@3"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tree"
brew "wget"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "coconutbattery"
cask "deluge"
cask "discord"
cask "drawio"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "keyboardcleantool"
cask "keyclu"
cask "logi-options-plus"
cask "maccy"
cask "macs-fan-control"
cask "notion"
cask "obs"
cask "postman"
cask "proxyman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zoom"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.liveserver"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
