tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "clang-format"
brew "fzf"
brew "gcc@11"
brew "git"
brew "htop"
brew "openssl@3"
brew "mailsy"
brew "neovim"
brew "nvm"
brew "postgresql@15"
brew "pyenv"
brew "ripgrep"
brew "s-search"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "coconutbattery"
cask "dbeaver-community"
cask "deluge"
cask "discord"
cask "drawio"
cask "figma"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "maccy"
cask "macs-fan-control"
cask "notion"
cask "obs"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "Equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.LiveServer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
