[
  "calendar",
  "table-editor-obsidian",
  "periodic-notes",
  "url-into-selection",
  "darlal-switcher-plus",
  "obsidian-auto-link-title",
  "obsidian-text-format",
  "hotkeysplus-obsidian",
  "obsidian-list-callouts",
  "hotkey-helper",
  "link-favicon",
  "callout-manager",
  "obsidian-file-link",
  "tag-wrangler",
  "obsidian-icon-folder",
  "obsidian-admonition",
  "obsidian-vimrc-support",
  "dataview",
  "templater-obsidian",
  "mousewheel-image-zoom",
  "code-styler",
  "omnisearch",
  "obsidian-style-settings"
]